In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [4]:
obj=pd.Series(range(4), index=['j','i','k','p'])
obj.sort_index()

i    1
j    0
k    2
p    3
dtype: int64

In [12]:
df=pd.DataFrame(np.arange(8).reshape(2,4), index=['three','one'], columns=['k','j','i','p'])
df.sort_index()
df.sort_index(axis=1, ascending=False)

       p  k  j  i
three  3  0  1  2
one    7  4  5  6

In [15]:
obj=pd.Series([2, np.nan, 5, -3, 0])
obj.sort_values()

3   -3.0
4    0.0
0    2.0
2    5.0
1    NaN
dtype: float64

In [21]:
df=pd.DataFrame({'z':[3,2,-1,5], 'a':[0,1,0,1]})
df.sort_values(by=['a','z'])

   z  a
2 -1  0
0  3  0
1  2  1
3  5  1

In [22]:
obj=pd.Series(range(5), index=['a','a','b','b','c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [23]:
obj.index.is_unique

False

In [24]:
type(obj['a'])

pandas.core.series.Series

In [27]:
df=pd.DataFrame(np.random.randn(4,3), index=['a','a','b','b'])
df

          0         1         2
a -0.746684 -0.296775  1.309001
a  0.706495  0.738672 -0.566345
b  0.599941 -1.781747 -0.870771
b -0.048747 -2.253310  0.494788

In [35]:
df.loc['b']

          0         1         2
b  0.599941 -1.781747 -0.870771
b -0.048747 -2.253310  0.494788

In [39]:
df=pd.DataFrame([[1.3, np.nan], [7.5, -5.5], [np.nan, np.nan], [0.5, -1.5]], index=['a','b','c','d'], columns=['one','two'])
df

   one  two
a  1.3  NaN
b  7.5 -5.5
c  NaN  NaN
d  0.5 -1.5

In [41]:
df.sum()
df.sum(axis='columns')

a    1.3
b    2.0
c    0.0
d   -1.0
dtype: float64

In [44]:
print(df)
df.mean(axis=1, skipna=False)

   one  two
a  1.3  NaN
b  7.5 -5.5
c  NaN  NaN
d  0.5 -1.5

a    NaN
b    1.0
c    NaN
d   -0.5
dtype: float64

In [45]:
df.idxmax()

one    b
two    d
dtype: object

In [46]:
df.cumsum()

   one  two
a  1.3  NaN
b  8.8 -5.5
c  NaN  NaN
d  9.3 -7.0

In [47]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.100000 -3.500000
std    3.831449  2.828427
min    0.500000 -5.500000
25%    0.900000 -4.500000
50%    1.300000 -3.500000
75%    4.400000 -2.500000
max    7.500000 -1.500000

In [49]:
obj=pd.Series(['a','a','b','b','c']*3)
obj.describe()

count     15
unique     3
top        a
freq       6
dtype: object

In [ ]:
# Collaborative Filtering (협업 필터링)

In [50]:
critics={'BTS':{'암수살인':5, '바울':4, '할로윈':1.5},
    '손흥민':{'바울':5, '할로윈':2},
    '레드벨벳':{'암수살인':2.5, '바울':2, '할로윈':1},
    '트와이스':{'암수살인':3.5, '바울':4, '할로윈':5}}
# 두 사람 간 유사도 -> 예상 평점

In [56]:
critics['손흥민']
critics.get('손흥민')
critics['손흥민']['할로윈']
critics.get('손흥민')['할로윈']
critics.get('손흥민').get('할로윈')

2

In [57]:
from math import sqrt

In [59]:
pow(2,3)
#sqrt(pow((x1-x2), 2)+pow((y1-y2), 2))
sqrt(pow(1,2)+pow(2,2))

2.23606797749979

In [62]:
def sim(i, j): #i:x2-x1, j:y2-y1
    return sqrt(pow(i, 2)+pow(j,2))
x1=critics['손흥민']['바울']
x2=critics['손흥민']['할로윈']
y1=critics['트와이스']['바울']
y2=critics['트와이스']['할로윈']
z1=critics['레드벨벳']['바울']
z2=critics['레드벨벳']['할로윈']
b1=critics['BTS']['바울']
b2=critics['BTS']['할로윈']
i=y1-x1
j=y2-x2
k=z1-x1
l=z2-x2
m=b1-x1
n=b2-x2
print(sim(i, j))
print(sim(k, l))
print(sim(m, n))

3.1622776601683795
3.1622776601683795
1.118033988749895

In [71]:
for c in critics:
    if c!='손흥민':
        num1=critics.get('손흥민').get('바울')-critics.get(c).get('바울')
        num2=critics.get('손흥민').get('할로윈')-critics.get(c).get('할로윈')
        print(c, sim(num1, num2)) # sim 함수 값이 클수록 0에 근사, sim 함수 값이 작을수록 무한대에 근사

BTS 1.118033988749895
레드벨벳 3.1622776601683795
트와이스 3.1622776601683795

In [72]:
for c in critics:
    if c!='손흥민':
        num1=critics.get('손흥민').get('바울')-critics.get(c).get('바울')
        num2=critics.get('손흥민').get('할로윈')-critics.get(c).get('할로윈')
        print(c, 1/(sim(num1, num2)+1)) # 0에 가까울수록 두 사람의 영화 취향이 매우 다름, 무한대에 가까울수록 두 사람의 영화 취향이 비슷

BTS 0.4721359549995794
레드벨벳 0.2402530733520421
트와이스 0.2402530733520421

In [ ]:
critics = {

    '레드벨벳': {

        '택시운전사': 2.5,

        '겨울왕국': 3.5,

        '리빙라스베가스': 3.0,

        '넘버3': 3.5,

        '사랑과전쟁': 2.5,

        '세계대전': 3.0,

    },

    'BTS': {

        '택시운전사': 1.0,

        '겨울왕국': 4.5,

        '리빙라스베가스': 0.5,

        '넘버3': 1.5,

        '사랑과전쟁': 4.5,

        '세계대전': 5.0,

    },

    '블랙핑크': {

        '택시운전사': 3.0,

        '겨울왕국': 3.5,

        '리빙라스베가스': 1.5,

        '넘버3': 5.0,

        '세계대전': 3.0,

        '사랑과전쟁': 3.5,

    },

    '소녀시대': {

        '택시운전사': 2.5,

        '겨울왕국': 3.0,

        '넘버3': 3.5,

        '세계대전': 4.0,

    },

    '마마무': {

        '겨울왕국': 3.5,

        '리빙라스베가스': 3.0,

        '세계대전': 4.5,

        '넘버3': 4.0,

        '사랑과전쟁': 2.5,

    },

    '오마이걸': {

        '택시운전사': 3.0,

        '겨울왕국': 4.0,

        '리빙라스베가스': 2.0,

        '넘버3': 3.0,

        '세계대전': 3.5,

        '사랑과전쟁': 2.0,

    },

    '모모랜드': {

        '택시운전사': 3.0,

        '겨울왕국': 4.0,

        '세계대전': 3.0,

        '넘버3': 5.0,

        '사랑과전쟁': 3.5,

    },

    '우주소녀': {'겨울왕국': 4.5, '사랑과전쟁': 1.0,

             '넘버3': 4.0},

}